app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("name", "surname", "age", "adres", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Türkan"], ["surname", "Zeytun"], ["age", 19], ["adres", "ksdkosapd"], ["created_at", "2015-07-21 06:44:59.213949"], ["updated_at", "2015-07-21 06:44:59.213949"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_post
      @post = Post.find(params[:id])